ЛИС2/src/Catalogs/ЗВАтмосфера/ЗВАтмосфера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗВАтмосфера</name>
  <comment>В справочнике содержатся сведения о веществах, загрязняющих атмосферный воздух.</comment>
  <predefined>
    <items>
      <name>ДиоксидАзота</name>
      <description>Азот диоксид</description>
    </items>
    <items>
      <name>ОксидАзота</name>
      <description>Азот оксид</description>
    </items>
    <items>
      <name>Бензапирен</name>
      <description>Бензапирен</description>
    </items>
    <items>
      <name>Бензин</name>
      <description>Бензин (нефтяной, малосернистый) в пересчете на углерод</description>
    </items>
    <items>
      <name>Бензол</name>
      <description>Бензол</description>
    </items>
    <items>
      <name>ВзвешенныеВещества</name>
      <description>Взвешенные вещества (недифференцированная по составу пыль (аэрозоль), содержащаяся в воздухе населен</description>
    </items>
    <items>
      <name>Гидрохлорид</name>
      <description>Гидрохлорид (Водород хлористый, Соляная кислота) /по молекуле HCl/</description>
    </items>
    <items>
      <name>ВанадияПятиокись</name>
      <description>диВанадий пентоксид (пыль) (Ванадия пятиокись)</description>
    </items>
    <items>
      <name>Дигидросульфид</name>
      <description>Дигидросульфид (Сероводород)</description>
    </items>
    <items>
      <name>Диметилбензол</name>
      <description>Диметилбензол ( ксилол) (смесь изомеров о-, м-, п-)</description>
    </items>
    <items>
      <name>ЗолаУглей</name>
      <description>Зола углей Подмосковного, Печорского, Кузнецкого, Донецкого, Экибастузского, марки Б1 Бабаевского...</description>
    </items>
    <items>
      <name>Керосин</name>
      <description>Керосин</description>
    </items>
    <items>
      <name>МазутнаяЗолаВПересчетеНаВанадий</name>
      <description>Мазутная зола теплоэлектростанций (в пересчете на ванадий)</description>
    </items>
    <items>
      <name>МаслоМинеральноеНефтяное</name>
      <description>Масло минеральное нефтяное (веретенное, машинное, цилиндровое и д.р.)</description>
    </items>
    <items>
      <name>Метан</name>
      <description>Метан</description>
    </items>
    <items>
      <name>Метанол</name>
      <description>Метанол (метиловый спирт)</description>
    </items>
    <items>
      <name>Метилбензол</name>
      <description>Метилбензол (Толуол)</description>
    </items>
    <items>
      <name>НатрийГидроксид</name>
      <description>Натрий гидроксид (Натр едкий; Сода каустическая)</description>
    </items>
    <items>
      <name>Озон</name>
      <description>Озон</description>
    </items>
    <items>
      <name>Пентилены</name>
      <description>Пентилены (Амилены - смесь изомеров)</description>
    </items>
    <items>
      <name>ПыльМучная</name>
      <description>Пыль мучная</description>
    </items>
    <items>
      <name>ПыльРезиновогоВулканизата</name>
      <description>Пыль тонко измельченного резинового вулканизата из отходов подошвенных резин</description>
    </items>
    <items>
      <name>Свинец</name>
      <description>Свинец и его неорганические соединения в пересчете на свинец</description>
    </items>
    <items>
      <name>ДиоксидСеры</name>
      <description>Сера диоксид (Ангидрид сернистый)</description>
    </items>
    <items>
      <name>СернаяКислота</name>
      <description>Серная кислота</description>
    </items>
    <items>
      <name>СмесьПриродныхМеркаптанов</name>
      <description>Смесь природных меркаптанов</description>
    </items>
    <items>
      <name>СмесьУглеводородовПредельныхС1С5</name>
      <description>Смесь углеводородов предельных С1-С5</description>
    </items>
    <items>
      <name>СмесьУглеводородовПредельныхС6С10</name>
      <description>Смесь углеводородов предельных С6-С10</description>
    </items>
    <items>
      <name>Углеводороды</name>
      <description>Углеводороды</description>
    </items>
    <items>
      <name>УглеводородыПредельныеС12С19</name>
      <description>Углеводороды предельные С12-С19</description>
    </items>
    <items>
      <name>УглеродСажа</name>
      <description>Углерод (Сажа)</description>
    </items>
    <items>
      <name>УглеродДиоксид</name>
      <description>Углерод диоксид</description>
    </items>
    <items>
      <name>ОксидУглерода</name>
      <description>Углерод оксид</description>
    </items>
    <items>
      <name>УксуснаяКислота</name>
      <description>Уксусная кислота</description>
    </items>
    <items>
      <name>УксусныйАльдегид</name>
      <description>Уксусный альдегид</description>
    </items>
    <items>
      <name>ФтористыеГазообразныеСоединения</name>
      <description>Фтористые газообразные соединения: - гидрофторид - кремний тетрафторид /в пересчете на фтор/</description>
    </items>
    <items>
      <name>Этилбензол</name>
      <description>Этилбензол</description>
    </items>
    <items>
      <name>ЭтиловыйСпирт</name>
      <description>Этиловый спирт</description>
    </items>
  </predefined>
  <attributes>
    <name>КлассОпасности</name>
    <type>
      <types>EnumRef.КлассОпасности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммыВеществ</name>
    <type>
      <types>CatalogRef.СуммыВеществ00010099</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЛИС2/src/Enums/ВидыПротоколаПромышленныхВыбросов/ВидыПротоколаПромышленныхВыбросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПротоколаПромышленныхВыбросов</name>
  <enumValues>
    <name>ДляРегистрации</name>
  </enumValues>
  <enumValues>
    <name>ДляРасчета</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/ЗВАтмосфера/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	ВидПротокола = Неопределено;
	Параметры.Свойство("ВидПротокола", ВидПротокола);
	
	Если ВидПротокола = Перечисления.ВидыПротоколаПромышленныхВыбросов.ДляРасчета Тогда
		
		СписокЗВ = Новый СписокЗначений;
		СписокЗВ.Добавить(Справочники.ЗВАтмосфера.ОксидУглерода.Ссылка);
		СписокЗВ.Добавить(Справочники.ЗВАтмосфера.ОксидАзота.Ссылка);
		СписокЗВ.Добавить(Справочники.ЗВАтмосфера.ДиоксидАзота.Ссылка);
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	    ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование    = Истина;
	    ЭлементОтбора.ПравоеЗначение   = СписокЗВ;
		
		Элементы.ПереключательРазрешения.Видимость = Ложь;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ДействующееРазрешение) = Истина Тогда
		
		ДанныеРазрешения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ДействующееРазрешение, "РегистрационныйНомер, ДатаВыдачи, ТаблицаЗВ");
		
		ТаблицаЗВРазрешения = ДанныеРазрешения.ТаблицаЗВ.Выгрузить();
		ПереченьЗВРазрешения.ЗагрузитьЗначения(ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаЗВРазрешения,"ЗагрязняющееВещество"));
		
		СтрокаРазрешения = "№ " + ДанныеРазрешения.РегистрационныйНомер + " от " + Формат(ДанныеРазрешения.ДатаВыдачи,"ДФ=dd.MM.yyyy");
		
	Иначе 
		
		Элементы.ПереключательРазрешения.Видимость = Ложь;
		
		СтрокаРазрешения = "Выброс без документа разрешения";
		
	КонецЕсли;
	
	ПереключательРазрешения = "Полный";

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

&НаКлиенте
Процедура ПереключательРазрешенияПриИзменении(Элемент)
	
	Если ПереключательРазрешения = "Полный" Тогда
	
		Список.Отбор.Элементы.Очистить();
		
	ИначеЕсли ПереключательРазрешения = "ИзДокументаРазрешения" Тогда

		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование    = Истина;
		ЭлементОтбора.ПравоеЗначение   = ПереченьЗВРазрешения;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
